In [34]:
import pandas as pd

table=[('Alan',25,68,'NewYork'),('Bob',30,70,'Leo anggle'),
      ('Dannie',22,90,'France'),('David',23,80,'London'),
      ('Kari',19,75,'Osio'),('Amie',22,77,'Becenome'),
      ('Daminan',27,82,'France')]

df=pd.DataFrame(table,columns=['Name','Age','Score','City'])

df

      Name  Age  Score        City
0     Alan   25     68     NewYork
1      Bob   30     70  Leo anggle
2   Dannie   22     90      France
3    David   23     80      London
4     Kari   19     75        Osio
5     Amie   22     77    Becenome
6  Daminan   27     82      France

In [35]:
selection_of_1=df['Name']
selection_of_2=df[['Name','Score']]

print(selection_of_1)
print('***************\n')
print(selection_of_2)

0       Alan
1        Bob
2     Dannie
3      David
4       Kari
5       Amie
6    Daminan
Name: Name, dtype: object
***************

      Name  Score
0     Alan     68
1      Bob     70
2   Dannie     90
3    David     80
4     Kari     75
5     Amie     77
6  Daminan     82

In [36]:
selection_of_3=df[0:2]
selection_of_4=df.iloc[:,1:3]

print(selection_of_3)
print('\n***************\n')
print(selection_of_4)

   Name  Age  Score        City
0  Alan   25     68     NewYork
1   Bob   30     70  Leo anggle

***************

   Age  Score
0   25     68
1   30     70
2   22     90
3   23     80
4   19     75
5   22     77
6   27     82

In [20]:
selection_of_5=df.loc[:,['Name','City']]
selection_of_5

      Name        City
0     Alan     NewYork
1      Bob  Leo anggle
2   Dannie      France
3    David      London
4     Kari        Osio
5     Amie    Becenome
6  Daminan      France

In [59]:
raw_data={'FName':['smeldon','raj','leopard','haward','may'],
         'LName':['Copper','Northwell','gfbb','Nicklus','rawler'],
         'Age':[42,38,36,41,35],
         'Comedy_score':[5,7,8,8,5],
         'Nating_score':[25,25,48,62,70]}

df1=pd.DataFrame(raw_data,columns=['FName','LName','Age','Comedy_score','Nating_score'])

print(df1)

     FName      LName  Age  Comedy_score  Nating_score
0  smeldon     Copper   42             5            25
1      raj  Northwell   38             7            25
2  leopard       gfbb   36             8            48
3   haward    Nicklus   41             8            62
4      may     rawler   35             5            70

In [58]:
print(df1.sort_values(by='Age',ascending=0))

     FName      LName  Age  Comedy_score  Nating_score
0  smeldon     Copper   42             5            25
3   haward    Nicklus   41             8            62
1      raj  Northwell   38             7            25
2  leopard       gfbb   36             8            48
4      may     rawler   35             5            70

In [57]:
print(df1.sort_values(by='Age',ascending=1))

     FName      LName  Age  Comedy_score  Nating_score
4      may     rawler   35             5            70
2  leopard       gfbb   36             8            48
1      raj  Northwell   38             7            25
3   haward    Nicklus   41             8            62
0  smeldon     Copper   42             5            25

In [56]:
print(df1.sort_values(by=['Age','Comedy_score']))

     FName      LName  Age  Comedy_score  Nating_score
4      may     rawler   35             5            70
2  leopard       gfbb   36             8            48
1      raj  Northwell   38             7            25
3   haward    Nicklus   41             8            62
0  smeldon     Copper   42             5            25

In [55]:
group_g=df1.groupby(['Age'])
print(group_g)
print(group_g.size())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000025F0D6E2AF0>
Age
35    1
36    1
38    1
41    1
42    1
dtype: int64

In [53]:
g2=df1.groupby(['Comedy_score','Nating_score'])
print(g2)
print(g2.size())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000025F0FE46040>
Comedy_score  Nating_score
5             25              1
              70              1
7             25              1
8             48              1
              62              1
dtype: int64

In [61]:
print('Index of larger value ')
#print(df1['Comedy_score'].ioxmax())

Index of larger value